In [1]:
import pandas as pd

# 4.5 数据选择

In [2]:
df = pd.read_excel('team2.xlsx')
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

# 4.5.1 选择列

In [16]:
# 1,切片操作
df['name']

# 2, .点操作
# df.name 同上

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [17]:
# 以下情况只能用切片操作，不能使用点操作
# df.1city 报语法错，因为点后面的列名不能是数字开头或带空格。
df['1city']

0    shanghai
1      nanjin
2      beijin
3     tianjin
4       henan
5       hebei
Name: 1city, dtype: object

In [19]:
df['what color']
# df.what color 报语法错，因为点后面的列名不能是数字开头或带空格。

0    yellew
1       red
2    purple
3      blue
4     black
5      pink
Name: what color, dtype: object

In [20]:
# 数据类型是Series
type(df.name)

pandas.core.series.Series

# 4.5.2 切片

In [4]:
# 1，前2行（左闭右开），默认所有列 (dataFrame)
df[:2]

    name team  Q1  Q2  Q3  Q4     1city what color
0  Liver    E  89  21  24   1  shanghai     yellew
1   Arry    C  55  37  37   2    nanjin        red

In [5]:
# 2，第2，3行的数据(dataFrame)
df[1:3]

   name team  Q1  Q2  Q3  Q4   1city what color
1  Arry    C  55  37  37   2  nanjin        red
2   Ack    A  57  60  33   3  beijin     purple

In [29]:
# 3，按步长取，如按步长2取索引号小于5的行(不包含表头，取1，3，5行数据)
df[:5:2]

    name team  Q1  Q2  Q3  Q4     1city what color
0  Liver    E  89  21  24   1  shanghai     yellew
2    Ack    A  57  60  33   3    beijin     purple
4    Oah    D  93  49  44   5     henan      black

In [30]:
# 4，反转顺序
df[::-1]

     name team  Q1  Q2  Q3  Q4     1city what color
5  Harlie    C  24  13  87   6     hebei       pink
4     Oah    D  93  49  44   5     henan      black
3   Eorge    C  93   4  71   4   tianjin       blue
2     Ack    A  57  60  33   3    beijin     purple
1    Arry    C  55  37  37   2    nanjin        red
0   Liver    E  89  21  24   1  shanghai     yellew

In [34]:
# 5，按列名筛选（DataFrame，两个中括号表示选择1列或多列）
df[['name','Q4']]

     name  Q4
0   Liver   1
1    Arry   2
2     Ack   3
3   Eorge   4
4     Oah   5
5  Harlie   6

In [35]:
# 6，按列名筛选（Series，一个中括号表示只有1列）
df['name']

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [36]:
type(df[['name']])

pandas.core.frame.DataFrame

In [37]:
type(df['name'])

pandas.core.series.Series

In [40]:
# 7，Series获取具体值
df['name'][0]

'Liver'

In [ ]:
# 切片中支持条件表达式，可按条件查询数据，见5.1

# 4.5.3 按轴标签获取行 .loc

In [80]:
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [81]:
# 1，获取索引为0的行（返回一条数据就是series）
df.loc[0]

name             Liver
team                 E
Q1                  89
Q2                  21
Q3                  24
Q4                   1
1city         shanghai
what color      yellew
Name: 0, dtype: object

In [82]:
# （返回一条数据就是series）
type(df.loc[0])

pandas.core.series.Series

In [83]:
# 2，获取索引0的name值
df.loc[0]['name']
# df.loc[0][0] 同上

'Liver'

In [84]:
# 3，先索引name，再获取name为oah对应的行数据（返回一条数据就是series）
df.set_index('name').loc['Oah']

team              D
Q1               93
Q2               49
Q3               44
Q4                5
1city         henan
what color    black
Name: Oah, dtype: object

In [85]:
df.set_index('name').loc['Oah']['Q1']
df.set_index('name').loc['Oah'][1] # 同上

93

In [86]:
# 4，按索引号获取多行数据（DataFrame）
df.loc[[0,2,4]]

    name team  Q1  Q2  Q3  Q4     1city what color
0  Liver    E  89  21  24   1  shanghai     yellew
2    Ack    A  57  60  33   3    beijin     purple
4    Oah    D  93  49  44   5     henan      black

In [87]:
# 5，先索引name，再获取对应name的两行数据（DataFrame）
df.set_index('name').loc[['Ack','Oah']]

     team  Q1  Q2  Q3  Q4   1city what color
name
Ack     A  57  60  33   3  beijin     purple
Oah     D  93  49  44   5   henan      black

In [88]:
# 6，获取前5行name列数据
df.loc[0:5,['name']]

     name
0   Liver
1    Arry
2     Ack
3   Eorge
4     Oah
5  Harlie

In [89]:
# 7, 获取前4行且Q3右边所有列
df.loc[:3,'Q3':]

   Q3  Q4     1city what color
0  24   1  shanghai     yellew
1  37   2    nanjin        red
2  33   3    beijin     purple
3  71   4   tianjin       blue

# 4.5.4 按数字索引获取行 .iloc

In [90]:
# loc 前4行（双闭），默认所有列
df.loc[:3]

    name team  Q1  Q2  Q3  Q4     1city what color
0  Liver    E  89  21  24   1  shanghai     yellew
1   Arry    C  55  37  37   2    nanjin        red
2    Ack    A  57  60  33   3    beijin     purple
3  Eorge    C  93   4  71   4   tianjin       blue

In [91]:
# 1，iloc 前3行（左闭右开），默认所有列
df.iloc[:3]

    name team  Q1  Q2  Q3  Q4     1city what color
0  Liver    E  89  21  24   1  shanghai     yellew
1   Arry    C  55  37  37   2    nanjin        red
2    Ack    A  57  60  33   3    beijin     purple

In [92]:
# 2，前3行，且索引0、1列
df.iloc[:3,[0,1]]

    name team
0  Liver    E
1   Arry    C
2    Ack    A

In [93]:
# 3，前3行，且所有列
df.iloc[:3,:]

    name team  Q1  Q2  Q3  Q4     1city what color
0  Liver    E  89  21  24   1  shanghai     yellew
1   Arry    C  55  37  37   2    nanjin        red
2    Ack    A  57  60  33   3    beijin     purple

In [94]:
# 4，前3行，且屏蔽最后2列
df.iloc[:3,:-2]

    name team  Q1  Q2  Q3  Q4
0  Liver    E  89  21  24   1
1   Arry    C  55  37  37   2
2    Ack    A  57  60  33   3

  # 4.5.5 取具体值 .at/.iat

In [95]:
# 1,索引0，name列的值
# df.at[index,columns]
df.at[0,'name']

'Liver'

In [96]:
# 2, df.iat[行号,列号]
df.iat[0, 0]

'Liver'

In [89]:
# 3, name列，索引0的值
df.name.get(0)
# df.name.at[0] 同上

'Liver'

In [92]:
df.loc[0].at['name']

'Liver'

In [93]:
# df.loc.iat[列号]
df.loc[0].iat[0]

'Liver'

In [94]:
df.loc[0]['name']

'Liver'

In [95]:
df.loc[0][0]

'Liver'

In [98]:
# df.set_index.at[行名，列名]
# 4，先索引name，再获取名字为Ack的team值
df.set_index('name').at['Ack','team']

'A'

In [99]:
# df.set_index.at[行名]
# 5，先索引name，再获team为Ack的值
df.set_index('name').team.at['Ack']

'A'

# 4.5.6 获取数据

In [100]:
# 1, 获取name列的值
df.get('name')

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [101]:
df.get('nameXXX',0)

0

In [102]:
# 2, 获取name列的索引1的值
df.name.get(1)

'Arry'

# 4.5.7 数据截取 .truncate

In [103]:
# 可以对datFrame和Series进行截取
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [104]:
# 1,截取索引1之前和索引3之后的行数据
df.truncate(before=1,after=3)

    name team  Q1  Q2  Q3  Q4    1city what color
1   Arry    C  55  37  37   2   nanjin        red
2    Ack    A  57  60  33   3   beijin     purple
3  Eorge    C  93   4  71   4  tianjin       blue

In [108]:
df.get('name')

0     Liver
1      Arry
2       Ack
3     Eorge
4       Oah
5    Harlie
Name: name, dtype: object

In [109]:
s = df.get('name')
s.truncate(before=1,after=3)

1     Arry
2      Ack
3    Eorge
Name: name, dtype: object

# 4.5.8 索引选择器 IndexSlice

In [111]:
df.loc[pd.IndexSlice[:,['Q1','Q2']]]

   Q1  Q2
0  89  21
1  55  37
2  57  60
3  93   4
4  93  49
5  24  13

In [112]:
type(df.loc[pd.IndexSlice[:,['Q1','Q2']]])

pandas.core.frame.DataFrame

In [113]:
idx = pd.IndexSlice
df.loc[idx[:,['Q1','Q2']]]

   Q1  Q2
0  89  21
1  55  37
2  57  60
3  93   4
4  93  49
5  24  13

In [114]:
# 多索引，Q1到Q4
df.loc[idx[:, 'Q1':'Q4']]

   Q1  Q2  Q3  Q4
0  89  21  24   1
1  55  37  37   2
2  57  60  33   3
3  93   4  71   4
4  93  49  44   5
5  24  13  87   6

In [115]:
df

     name team  Q1  Q2  Q3  Q4     1city what color
0   Liver    E  89  21  24   1  shanghai     yellew
1    Arry    C  55  37  37   2    nanjin        red
2     Ack    A  57  60  33   3    beijin     purple
3   Eorge    C  93   4  71   4   tianjin       blue
4     Oah    D  93  49  44   5     henan      black
5  Harlie    C  24  13  87   6     hebei       pink

In [116]:
# 按条件查询复杂的选择器
# 如 筛选team=C且Q1>30
select = df.loc[(df.team=='C') & (df.Q1>30)]

In [117]:
idxs = pd.IndexSlice[select.index,'name']

In [118]:
df.loc[idxs]

1     Arry
3    Eorge
Name: name, dtype: object

In [121]:
type(df.loc[idxs])

pandas.core.series.Series

In [124]:
df.loc[idxs][1]

'Arry'